LuminousCX/LuomiNest/firmware/esp32-c6-coordinator/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_120M=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000

CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_MQTT_PROTOCOL_311=y

CONFIG_LWIP_SNTP_MAX_SERVERS=2
